# Useful methods and operations
* unique(), nunique(), value_counts(), sort_values(), apply(), index, column

In [1]:
import numpy as np
import pandas as pd

In [2]:
data_dic = {
    'col_1':[1,2,3,4,5],
    'col_2':[111,222,333,111,555],
    'col_3':['alpha','bravo','charlie',np.nan,np.nan],
}

df = pd.DataFrame(data_dic)
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

# unique()

In [4]:
print(df['col_1'].unique())
print(df['col_2'].unique())
print(df['col_3'].unique())

[1 2 3 4 5]
[111 222 333 555]
['alpha' 'bravo' 'charlie' nan]

# nunique()

In [5]:
print(df['col_1'].nunique())
print(df['col_2'].nunique())
print(df['col_3'].nunique())

5
4
3

# value_counts()

In [6]:
df.count()

col_1    5
col_2    5
col_3    3
dtype: int64

In [9]:
print(df['col_1'].value_counts())
print(df['col_2'].value_counts())
print(df['col_3'].value_counts())

1    1
2    1
3    1
4    1
5    1
Name: col_1, dtype: int64
111    2
222    1
333    1
555    1
Name: col_2, dtype: int64
alpha      1
bravo      1
charlie    1
Name: col_3, dtype: int64

# sort_values()

In [10]:
df.sort_values(by='col_3')

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

# apply()

In [16]:
# Our customized function to calculate the squares 
#def square(value):
    #return value*2

In [17]:
df['col_1'].apply(square)

0     2
1     4
2     6
3     8
4    10
Name: col_1, dtype: int64

In [18]:
df['col_1'].apply(lambda value:value*2)

0     2
1     4
2     6
3     8
4    10
Name: col_1, dtype: int64

In [19]:
# Let's confirm the type of NaN
type(np.nan)

float

In [20]:
# Getting index names
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['col_1', 'col_2', 'col_3'], dtype='object')]

In [21]:
# Getting column names
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [22]:
df

   col_1  col_2    col_3
0      1    111    alpha
1      2    222    bravo
2      3    333  charlie
3      4    111      NaN
4      5    555      NaN

In [27]:
# Deleting row (axis=0) or column (axis=1) 
print(df.drop('col_1',axis=1))
#print(df) # inplace = True for permanent change

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN

In [29]:
# deleting col_1 permanently
newdf= df.copy() # creating a copy, may need to use df at later stage
del newdf['col_1']
newdf

   col_2    col_3
0    111    alpha
1    222    bravo
2    333  charlie
3    111      NaN
4    555      NaN